src/cf/src/Documents/СписаниеТоваров/СписаниеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеТоваров</name>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <registerRecords>AccumulationRegister.Убытки</registerRecords>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ПересчётТоваров</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/AccumulationRegisters/ТоварыВНаличии/ТоварыВНаличии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВНаличии</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/Убытки/Убытки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Убытки</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Documents/СписаниеТоваров/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПересчётТоваров") Тогда
		Основание = ДанныеЗаполнения;
		Организация = ДанныеЗаполнения.Организация;
		МестоХранения = ДанныеЗаполнения.МестоХранения;
		ВидОперации = ДанныеЗаполнения.ВидОперации;
		Станок = ДанныеЗаполнения.Станок;
		ТЧТовары.Очистить();
		Для Каждого Стр Из ДанныеЗаполнения.ТЧТовары Цикл
			Отклонение = Стр.КоличествоУпаковок - Стр.КоличествоУпаковокФакт;
			Если Отклонение <= 0 Тогда Продолжить КонецЕсли;
			НС = ТЧТовары.Добавить();
			ЗаполнитьЗначенияСвойств(НС, Стр);				
			НС.КоличествоУпаковок = Отклонение;
			НС.Количество = Стр.Количество - Стр.КоличествоФакт;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда	
		Основание = ДанныеЗаполнения;
		Организация = ДанныеЗаполнения.Организация;
		МестоХранения = ДанныеЗаполнения.МестоХранения;
		ТЧТовары.Загрузить(ДанныеЗаполнения.ТЧТовары.Выгрузить());
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	УстановитьПривилегированныйРежим(Истина);
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	// Данные для проведения
	ЭтотОбъект.ДополнительныеСвойства.Вставить("ТЗТоварыССериями", СерииИРазмещение.ОбъединитьТоварыССериями(ЭтотОбъект));

	// Блокировки
	Блокировка = Новый БлокировкаДанных;
	УправляемыеБлокировки.ТоварыВНаличии(Блокировка, ТЧТовары, МестоХранения);
	Блокировка.Заблокировать();
	// Формируем
	Отказ = Не РегистрыНакопления.ТоварыВНаличии.СформироватьДвижения(ЭтотОбъект);
	Если Отказ Тогда Возврат КонецЕсли;
	РегистрыНакопления.Убытки.СформироватьДвижения(ЭтотОбъект);
	// Записываем
	Движения.Записать();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.Пользователь;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	РаботаСДокументами.МожноРедактироватьДокумент(ЭтотОбъект, Отказ);
	ЗагрузкаСтанков.ЗаполнитьСкладСтанкаДокумента(ЭтотОбъект, Отказ, Основание);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	// Вид операции «По станку» (волна 5): вместо места хранения проверяется станок.
	ЗагрузкаСтанков.ПроверяемыеРеквизитыСкладаСтанка(ЭтотОбъект, ПроверяемыеРеквизиты);
КонецПроцедуры

#КонецОбласти
